       IDENTIFICATION     DIVISION.

       PROGRAM-ID. OLAMUNDO.
       PROCEDURE          DIVISION.
           DISPLAY "OLA MUNDO"
           STOP RUN.
